
/**************Principle*******************

    Current Page          Swap Page
    ------------          ------------
    |  CP0     |          |          |
    ------------          ------------
    |D         |          |          |
    |          |          |          |
    |          |          |          |
    |  CP1     |          |          |
    |          |          |          |
    |          |          |          |
    |      M P |          |          |
    ------------          ------------
- D: write data
- CP1: Data area behind D
- CP2: Data area after  D
- M: Magic data (2 bytes)
- P: Page status

- 初始化：都擦除
- 强行写入数据（加长了写入时间）
 - 判断写入区域是否强行写入
   - 初级判断，是否都为0xff，这样时间固定
- 写入到 swap page
  - 写入D 内容，累计偏移地址，写入CP0内容直到D，写入D，写完再拷贝CP0，这种
  - 写入CP0和CP1内容

- 比较内容
  - OK的更新 M 和 P

- 为了减少切换，减少更新周期，同时掉电有足够的时间保存
- 适合page size 不大的单片机
***************************************/